ast_transforms/schematics/compiler_structure.dot
digraph {
  Start -> Lexer [label="Text (Code)"];
  Lexer -> Parser [label="Token stream"];
  Parser -> "Semantic Analysis" [label="AST"];
  "Semantic Analysis" -> "Intermediate code gen" [label="AST"];
  "Intermediate code gen" -> Optimizer [label="IR"];
  Optimizer -> "Code gen" [label="Optimized IR"];
  "Code gen" -> End [label="Target code"]
}
